<template>
  <div class="mx-3">
    <p>最后更新于：2022 年 10 月 14 日</p>
    <h1 id='xaufehole-西财树洞-隐私政策'>XAUFEHole 西财树洞 隐私政策</h1>
    <p>XAUFEHole
      西财树洞（下称“我们”）非常重视您的隐私。我们希望通过本隐私政策向您说明我们如何收集、使用、共享和保护您的个人信息。本隐私政策适用于我们的所有产品和服务，包括我们的网站、移动应用程序、社交媒体帐户、电子邮件和其他在线服务（统称“服务”）。本隐私政策不适用于我们的产品和服务中的第三方服务，也不适用于我们无法控制的第三方服务。我们建议您在使用我们的产品和服务之前仔细阅读本隐私政策。</p>
    <p>当您使用我们的服务时，即代表您同意本隐私政策。如果您不同意本隐私政策，请立即停止使用我们的服务。</p>
    <h2 id='我们收集的信息'>我们收集的信息</h2>
    <p>当您使用我们的服务时，我们会向您收集以下信息：</p>
    <ol start=''>
      <li>在您登录至我们的服务时，您根据我们的服务要求提供的个人注册信息；</li>
      <li>在您通过<em>西安财经大学统一身份认证系统</em>登录时，您的学号信息；</li>
      <li>
        在您使用我们的服务时，我们自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
      </li>

    </ol>
    <h2 id='我们如何使用您的信息'>我们如何使用您的信息</h2>
    <ol>
      <li>
        我们不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和我们单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料；
      </li>
      <li>
        我们亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何我们服务的平台用户如从事上述活动，一经发现，我们有权立即终止与该用户的服务协议；
      </li>
      <li>
        为服务用户的目的，我们可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与我们合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。
      </li>

    </ol>
    <h2 id='我们如何披露您的信息'>我们如何披露您的信息</h2>
    <p>在如下情况下，我们将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
    <ol>
      <li>经您事先同意，向第三方披露；</li>
      <li>为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</li>
      <li>根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</li>
      <li>如您出现违反中国有关法律、法规或者服务协议或相关规则的情况，需要向第三方披露；</li>
      <li>如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</li>
      <li>其它根据法律、法规或者网站政策认为合适的披露。</li>

    </ol>
    <h2 id='我们如何传输您的信息'>我们如何传输您的信息</h2>
    <p>
      我们收集的有关您的信息和资料将保存在我们或关联平台的服务器上，这些信息和资料可能传送至您所在国家、地区或我们收集信息和资料所在地的境外地区，并在境外被访问、存储和展示。</p>
    <h2 id='cookie-的使用'>Cookie 的使用</h2>
    <p>Cookie 是您在浏览网站时，网站发送浏览器的一小段文字，可让网站存储您的浏览信息，方便您下次浏览相同网站时套用同样的设置，以及为您提供更实用的服务。
      目前也有其他技术可应用在上述用途，包括通过专属ID识别浏览器、应用程序或装置、像素和本地存储空间。</p>
    <p>当您使用我们的服务时，即代表您同意我们使用 Cookie 或其他类似技术存储您的信息。</p>
  </div>
  <v-spacer class="my-10"></v-spacer>
  <div class="mx-3">
    <h1 id='xaufehole-西财树洞-服务条款'>XAUFEHole 西财树洞 服务条款</h1>
    <p>欢迎您使用 XAUFEHole
      西财树洞！在使用我们提供的服务前，请详细阅读此服务条款以了解您的义务和权利。本服务条款适用于我们的所有产品和服务，包括我们的网站、移动应用程序、社交媒体帐户、电子邮件和其他在线服务（统称“服务”）。</p>
    <p>当您使用我们的服务时，即代表您同意本服务条款。如果您不同意本服务条款，请立即停止使用我们的服务。</p>
    <h2 id='面向用户和适用法律'>面向用户和适用法律</h2>
    <p>本社区面向用户为与西安财经大学相关的个人和机构。</p>
    <p>本社区适用法律为《中华人民共和国宪法》及其他相关的地区法律法规。</p>
    <h2 id='内容版权与责任'>内容版权与责任</h2>
    <p>用户使用社区并上传任何信息时，即确认其享有所发布内容的版权 (比如原创)，或者使用内容属于教育、科学研究、评论与报道等
      &quot;合理使用&quot; 的范畴。如果用户享有内容的版权，即永久授权社区对其的发布与传播；</p>
    <p>用户对在社区上发表的内容、言论承担一切法律责任。</p>
    <h2 id='账户责任'>账户责任</h2>
    <ol start=''>
      <li>社区的账户仅供本人使用。账户的创立需要符合条件个人的验证。不满足使用条件的用户账户将被停用；</li>
      <li>管理团队一旦发现账户被多人使用，即有权无条件立即停用账号；</li>
      <li>我们有权以任何理由拒绝向用户提供服务。</li>

    </ol>
    <h2 id='技术性限制'>技术性限制</h2>
    <ol start=''>
      <li>
        管理团队为了保护社区软件平台的合理运行，有权对于行为异常的用户的账号加以技术性限制，包括但不限于限制某些功能的访问；
      </li>
      <li>
        用户禁止未经我们允许，对社区平台进行漏洞扫描、流量攻击、压力测试等可能会对社区平台造成破坏、数据损失、隐私泄露的操作。
      </li>

    </ol>
    <h2 id='个人隐私'>个人隐私</h2>
    <p>
      我们非常重视您的隐私，我们会按照我们隐私条款的规定使用和披露您的信息。使用我们的服务即代表您同时同意我们的隐私政策。</p>
    <h2 id='法律冲突'>法律冲突</h2>
    <p>本规范不构成对相关法律法规的任何有效修改，如有冲突，以相关法律法规与制度文件为准。</p>
    <h2 id='协议修改'>协议修改</h2>
    <p>本规范将会不定期修改，届时我们将会通过合理的方式告知您。</p>
  </div>
</template>

<script setup>
import {useRouter} from "vue-router";
import {onMounted} from "vue";

const router = useRouter()

const emit = defineEmits(['modifytitle', 'modifyicon', 'modifyactions'])

function handleClickAppbarIcon() {
  router.push("/")
}

onMounted(() => {
  emit('modifytitle', '隐私政策和服务条款')
  emit('modifyicon', {
    icon: "mdi-arrow-left",
    tooltip: "返回主页",
    handler: handleClickAppbarIcon
  })
})

</script>

<style scoped>

</style>
